<?php

return [
  'group' => [
    0 => 'WMS',
    1 => 'ERP',
    2 => 'MES',
  ],
  'os' => [
    0 => 'Linux',
    1 => 'WindowServer2008',
    2 => 'Window11',
    3 => 'Window10',
  ],
  'type' => [
    0 => 'Oracle',
    1 => 'PostgreSQL',
    2 => 'Apache HBase',
    3 => 'MongoDB',
    4 => 'Redis',
    5 => 'Mysql',
  ],
  'monitoring_item' => [
    0 => '系统日志',
    1 => '定时任务状态',
    2 => '服务日志',
    3 => '数据完整性',
    4 => '数据同步状态',
    5 => '安全审计',
    6 => 'IO 使用率',
    7 => '连接池状态',
    8 => '服务可用性',
    9 => '用户活跃度',
    10 => '日志大小',
    11 => '负载均衡状态',
    12 => '缓存命中率',
    13 => '连接数',
    14 => '磁盘读写速度',
    15 => '网络延迟',
    16 => '内存使用率',
    17 => 'CPU 使用率',
    18 => '备份状态',
    19 => '索引状态',
  ],
  'status' => [
    0 => '正常',
    1 => '异常',
  ],
];