<?php

return [
  'component_name' => [
    0 => '电池',
    1 => '马达',
    2 => '驱动器',
    3 => '摄像头',
    4 => '激光雷达（LiDAR）',
    5 => '红外传感器',
    6 => '超声波传感器',
    7 => '触觉传感器',
    8 => '微控制器',
    9 => '嵌入式系统',
    10 => '主板',
    11 => 'Wi-Fi模块',
    12 => '蓝牙模块',
    13 => 'RFID/NFC',
    14 => '机械臂',
    15 => '轮子或履带',
    16 => '关节',
    17 => '机身框架',
    18 => '防护罩',
    19 => '显示屏',
    20 => '扬声器和麦克风',
    21 => '传动带',
    22 => '传感器阵列',
  ],
  'status' => [
    0 => '正常',
    1 => '需要维修',
    2 => '更换中',
  ],
];