<?php

return [
  'group' => [
    0 => 'WMS',
    1 => 'ERP',
    2 => 'MES',
  ],
  'os' => [
    0 => 'Linux',
    1 => 'WindowServer2008',
    2 => 'Window10',
    3 => 'Windows11',
  ],
  'monitoring_item' => [
    0 => 'CPU 利用率',
    1 => '内存使用情况',
    2 => '磁盘空间',
    3 => '网络流量',
    4 => '系统日志',
    5 => '服务可用性',
    6 => '温度',
    7 => '风扇转速',
    8 => '电源状态',
    9 => '防火墙日志',
    10 => '安全补丁状态',
    11 => '用户登录情况',
    12 => '网络延迟',
    13 => '硬件故障日志',
    14 => '数据备份状态',
    15 => '虚拟化环境监测',
    16 => '系统资源分配',
    17 => '日常备份状态',
    18 => '网络安全日志',
  ],
  'status' => [
    0 => '正常',
    1 => '警告',
    2 => '异常',
  ],
];